.svn/pristine/0b/0ba287039be65ac6e1d1659990a42754661a4788.svn-base

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:checkInAndPayWithPayType
			xmlns:ns2="http://framework.facade.common.transcore.pinganfu.com/">
			<arg0>  <!--话费充值 -->
				<busiChannel>P</busiChannel>
				<customerId>1000010000026540</customerId> 
				<customerName>二维码商户</customerName>
				<dcFlag>C</dcFlag>
				<extFeilds>{"mobile":"15000956051"}</extFeilds>
				<orderNo>${orderNo}</orderNo>
				<paymentMode>16777216</paymentMode>
				<productCode>100010020000</productCode>
				<registerFlag>0</registerFlag>
				<subLedgerFlag>0</subLedgerFlag>
				<toCustomerId>1000010000000734</toCustomerId>
				<tranDetails>
					<currencyCode>CNY</currencyCode>
					<payAcctId>801</payAcctId>
					<payAmt>100000</payAmt>
					<payType>24</payType>
				</tranDetails>
				<transAmt>100000</transAmt>
				<transFactAmt>100000</transFactAmt>
				<transType>12</transType>
			</arg0>
		</ns2:checkInAndPayWithPayType>
	</soap:Body>
</soap:Envelope>